---------------- GROUP BY -------------------

use T_MyBase

-------- 1 задание -------

select ТОВАРЫ.[Название товара],
		max(ТОВАРЫ.Цена)[Максимальная стоимость],
		min(ТОВАРЫ.Цена)[Минимальная стоимость],
		avg(ТОВАРЫ.Цена)[Средняя стоимость],
		sum(ТОВАРЫ.Цена)[Суммарная стоимость],
		count(*) [Общее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
	group by ТОВАРЫ.[Название товара]

-------- 2 задание -------

select ТОВАРЫ.[Название товара],
		max(ТОВАРЫ.Цена) as 'Максимальная стоимость',
		min(ТОВАРЫ.Цена) as 'Минимальная стоимость',
		avg(ТОВАРЫ.Цена) as 'Средняя стоимость',
		sum(ТОВАРЫ.Цена) as 'Суммарная стоимость',
		count(*)  as 'Общее количество заказов'
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
	group by ТОВАРЫ.[Название товара]

-------- 3 задание -------

select *
	from(select case
			when ТОВАРЫ.Цена between 50 and 1000 then 'Между 50 и 1000'
			when ТОВАРЫ.Цена between 1000 and  2000 then 'Между 1000 и 2000'
			else 'Остальное'
			end[Промежутки цен], count(*)[Количество товаров] 
			from ТОВАРЫ group by case
			when ТОВАРЫ.Цена between 50 and 1000 then 'Между 50 и 1000'
			when ТОВАРЫ.Цена between 1000 and  2000 then 'Между 1000 и 2000'
			else 'Остальное'
			end) as T
				order by case [Промежутки цен]
			when 'Между 50 и 1000' then 3
			when 'Между 1000 и 2000' then 2
			when 'Остальное' then 1
			else 0 end

-------- 4 задание -------

select t.[Название товара], round(avg(cast(z.[Количество заказанного товара] as float(4))), 2)[Среднее количество]
	from ТОВАРЫ as t
		inner join ЗАКАЗЫ as z
			on t.[ID товара] = z.[ID товара]
		group by t.[Название товара]
	
-------- 5 задание -------

select t.[Название товара], round(avg(cast(z.[Количество заказанного товара] as float(4))), 2)[Среднее количество]
	from ТОВАРЫ as t
		inner join ЗАКАЗЫ as z
			on t.[ID товара] = z.[ID товара]
		where t.[Название товара] like '%кот%'
		group by t.[Название товара]

-------- 6 задание -------

select t.[Название товара], round(avg(cast(z.[Количество заказанного товара] as float(4))), 2)[Среднее количество]
	from ТОВАРЫ as t
		inner join ЗАКАЗЫ as z
			on t.[ID товара] = z.[ID товара]
		where z.[Телефон заказчика] like '37529%'
		group by t.[Название товара]

-------- 7 задание -------

select t.[Название товара], (select count(*) from ЗАКАЗЫ tt where t.[ID товара] = tt.[ID товара]
								and t.[Название товара] like '%кот%') [Количество]
								from ТОВАРЫ as t
								group by t.[ID товара], t.[Название товара]
								having t.[Название товара] like '%кот%'
