----- 1 ЗАДАНИЕ -----

	select ЗАКАЗЫ.[Телефон заказчика], ТОВАРЫ.[Название товара], ЗАКАЗЧИКИ.Имя, ЗАКАЗЧИКИ.Фамилия
		from ЗАКАЗЫ, ТОВАРЫ, ЗАКАЗЧИКИ
			where ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара] and ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
				and ЗАКАЗЫ.[ID товара] in (select ТОВАРЫ.[ID товара] from ТОВАРЫ 
													where ТОВАРЫ.[Название товара] like '%котел%')
				order by ТОВАРЫ.[Название товара] 
	
----- 2 ЗАДАНИЕ -----

	select ЗАКАЗЫ.[Телефон заказчика], ТОВАРЫ.[Название товара], ЗАКАЗЧИКИ.Имя, ЗАКАЗЧИКИ.Фамилия
		from ЗАКАЗЫ inner join ТОВАРЫ
			on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара], ЗАКАЗЧИКИ
			where ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
				and ЗАКАЗЫ.[ID товара] in (select ТОВАРЫ.[ID товара] from ТОВАРЫ 
													where ТОВАРЫ.[Название товара] like '%котел%')
		order by ТОВАРЫ.[Название товара] 

----- 3 ЗАДАНИЕ -----

	select ЗАКАЗЫ.[Телефон заказчика], ТОВАРЫ.[Название товара], ЗАКАЗЧИКИ.Имя, ЗАКАЗЧИКИ.Фамилия
		from ЗАКАЗЫ inner join ТОВАРЫ
			on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
			on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
			where ТОВАРЫ.[Название товара] like '%котел%'
		order by ТОВАРЫ.[Название товара] 

----- 4 ЗАДАНИЕ -----

select *
	from AUDITORIUM a
	where a.AUDITORIUM = (select top(1) aa.AUDITORIUM from AUDITORIUM aa
		where aa.AUDITORIUM_TYPE = a.AUDITORIUM_TYPE order by AUDITORIUM_CAPACITY desc)

select  *
	from ЗАКАЗЫ a
		where a.[Телефон заказчика] = (select top(1) aa.[Телефон заказчика] from ЗАКАЗЫ aa
			where a.[ID товара] = aa.[ID товара] order by [Количество заказанного товара] desc)

----- 5 ЗАДАНИЕ -----

select ТОВАРЫ.[ID товара], ТОВАРЫ.[Название товара]
	from ТОВАРЫ
		where not exists (select * from ЗАКАЗЫ	
							where ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара])

----- 6 ЗАДАНИЕ -----

select top 1
	(select avg(ТОВАРЫ.Цена) from ТОВАРЫ	
		where ТОВАРЫ.[Название товара] like '%котел%')[КОТЕЛ],
	(select avg(ТОВАРЫ.Цена) from ТОВАРЫ	
		where ТОВАРЫ.[Название товара] like '%насос%')[НАСОС]
		from ТОВАРЫ

----- 7 ЗАДАНИЕ -----

select ТОВАРЫ.[ID товара], ТОВАРЫ.[Название товара],ТОВАРЫ.Цена, ЗАКАЗЫ.[Количество заказанного товара]
	from ТОВАРЫ
		inner join ЗАКАЗЫ
			on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
				where ТОВАРЫ.Цена >= 
				ALL(select ТОВАРЫ.Цена from ТОВАРЫ
						where ТОВАРЫ.[Название товара] like '%котел%') and ТОВАРЫ.[Название товара] like '%котел%'
					

----- 8 ЗАДАНИЕ -----

select ТОВАРЫ.[ID товара], ТОВАРЫ.[Название товара],ТОВАРЫ.Цена, ЗАКАЗЫ.[Количество заказанного товара]
	from ТОВАРЫ
		inner join ЗАКАЗЫ
			on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
				where ТОВАРЫ.Цена <
				ANY(select ТОВАРЫ.Цена from ТОВАРЫ
						where ТОВАРЫ.[Название товара] like '%котел%') and ТОВАРЫ.[Название товара] like '%котел%'

----- 10 ЗАДАНИЕ -----

use UNIVER;
select a.IDSTUDENT, a.NAME, a.BDAY
	from STUDENT a
		where exists (select * from STUDENT aa where a.BDAY = aa.BDAY and a.IDSTUDENT != aa.IDSTUDENT)
	order by a.BDAY