SELECT ЗАКАЗЫ.Наименование_товара /* 1 запрос */
FROM   ТОВАРЫ INNER JOIN
             ЗАКАЗЫ ON ТОВАРЫ.Наименование = ЗАКАЗЫ.Наименование_товара
WHERE (ЗАКАЗЫ.Дата_поставки < CONVERT(DATETIME, '2023-10-10 00:00:00', 102))
ORDER BY ЗАКАЗЫ.Дата_поставки

SELECT ТОВАРЫ.Наименование /* 2 запрос */
FROM   ТОВАРЫ
WHERE (Цена >= 50 AND Цена <= 60)
ORDER BY Цена

SELECT ЗАКАЗЫ.Заказчик /* 3 запрос */
FROM   ЗАКАЗЫ
WHERE (Наименование_товара = N'Киви' OR Наименование_товара = N'Ананас')
ORDER BY Наименование_товара

SELECT ЗАКАЗЫ.Номер_заказа /* 4 запрос */
FROM   ЗАКАЗЫ
WHERE (Заказчик = N'LovelyFruits')
ORDER BY Дата_поставки
