------------ 1-1 задание ------------
use T_MyBase

select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%кот%'
		group by ТОВАРЫ.[Название товара]

------------ 1-2 задание ------------

select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%кот%'
		group by rollup(ТОВАРЫ.[Название товара])

------------ 2 задание ------------

select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%кот%'
		group by cube(ТОВАРЫ.[Название товара])

------------ 3-1 задание ------------

select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%кот%'
		group by (ТОВАРЫ.[Название товара])
		union
select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%iph%'
		group by (ТОВАРЫ.[Название товара])

------------ 3-2 задание ------------

select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%кот%'
		group by (ТОВАРЫ.[Название товара])
		union all
select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%iph%'
		group by (ТОВАРЫ.[Название товара])

------------ 4 задание ------------

select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%кот%'
		group by (ТОВАРЫ.[Название товара])
		intersect
select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%iph%'
		group by (ТОВАРЫ.[Название товара])

------------ 5 задание ------------

select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%кот%'
		group by (ТОВАРЫ.[Название товара])
		except
select ТОВАРЫ.[Название товара], avg(ЗАКАЗЫ.[Количество заказанного товара])[Среднее количество заказов]
	from ТОВАРЫ inner join ЗАКАЗЫ
		on ТОВАРЫ.[ID товара] = ЗАКАЗЫ.[ID товара]
		inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика]
		where ТОВАРЫ.[Название товара] like '%iph%'
		group by (ТОВАРЫ.[Название товара])