use T_MyBase;

----- 1 point -----

select ЗАКАЗЫ.[ID товара], ТОВАРЫ.[Название товара], ЗАКАЗЫ.[Количество заказанного товара], ТОВАРЫ.[Количество на складе]
	from ЗАКАЗЫ inner join ТОВАРЫ
		on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
	order by ЗАКАЗЫ.[ID товара]

----- 2 point -----

select ЗАКАЗЫ.[ID товара], ТОВАРЫ.[Название товара], ЗАКАЗЫ.[Количество заказанного товара], ТОВАРЫ.[Количество на складе]
	from ЗАКАЗЫ inner join ТОВАРЫ
		on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара] AND ТОВАРЫ.[Название товара] LIKE '%котел%'
	order by ЗАКАЗЫ.[ID товара]

----- 3 point -----

select ЗАКАЗЫ.[ID товара], ТОВАРЫ.[Название товара], ТОВАРЫ.Цена, ЗАКАЗЫ.[Количество заказанного товара], ЗАКАЗЧИКИ.Телефон,
	case
		when(ЗАКАЗЧИКИ.[Признак скидки] = 1) then 'есть'
		when(ЗАКАЗЧИКИ.[Признак скидки] = 0) then 'нет'
	end [СКИДКА]
	from ЗАКАЗЫ inner join ТОВАРЫ
		on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
	inner join ЗАКАЗЧИКИ
		on ЗАКАЗЫ.[Телефон заказчика] = ЗАКАЗЧИКИ.Телефон
	order by ЗАКАЗЫ.[ID товара] desc

----- 4 point -----

select ЗАКАЗЫ.[ID товара], ТОВАРЫ.[Название товара], isnull(ЗАКАЗЧИКИ.Телефон, '***')[Телефон],
	case
		when(ЗАКАЗЧИКИ.[Признак скидки] = 1) then 'есть'
	end [СКИДКА]
	from ЗАКАЗЫ left outer join ТОВАРЫ	
		on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
	inner join ЗАКАЗЧИКИ
		on ЗАКАЗЧИКИ.Телефон = ЗАКАЗЫ.[Телефон заказчика] and ЗАКАЗЧИКИ.[Признак скидки] = 1
	order by ЗАКАЗЫ.[ID товара]

----- 5-1 point -----

select isnull(ЗАКАЗЫ.[ID товара], -1), isnull(ЗАКАЗЫ.[Количество заказанного товара], 0), isnull(ЗАКАЗЫ.[Телефон заказчика], '***')
	from ЗАКАЗЫ full outer join ТОВАРЫ
		on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
	order by ЗАКАЗЫ.[ID товара]

----- 5-2 point -----

select ТОВАРЫ.[ID товара], ТОВАРЫ.[Количество на складе], ТОВАРЫ.[Название товара], ТОВАРЫ.Цена
	from ЗАКАЗЫ full outer join ТОВАРЫ	
		on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
	order by ТОВАРЫ.[ID товара]

----- 5-3 point -----

select isnull(ЗАКАЗЫ.[ID товара], -1)[ID товара], isnull(ЗАКАЗЫ.[Дата продажи], getdate())[Дата продажи], isnull(ЗАКАЗЫ.[Количество заказанного товара], 0), 
		isnull(ЗАКАЗЫ.[Телефон заказчика], '0'), ТОВАРЫ.[Количество на складе], ТОВАРЫ.[Название товара], ТОВАРЫ.Цена
	from ЗАКАЗЫ full outer join ТОВАРЫ
		on ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
	order by ЗАКАЗЫ.[ID товара]

----- 6 point -----

select ЗАКАЗЫ.[ID товара], ТОВАРЫ.[Название товара], ЗАКАЗЫ.[Количество заказанного товара], ТОВАРЫ.[Количество на складе]
	from ЗАКАЗЫ cross join ТОВАРЫ
		where ЗАКАЗЫ.[ID товара] = ТОВАРЫ.[ID товара]
	order by ЗАКАЗЫ.[ID товара]