---------- 1 задание ----------

use T_MyBase;

create view [Заказанные товары]
	as select t.[Название товара][Товар], t.[Количество на складе][Есть], sum(z.[Количество заказанного товара])[Зазакано]
		from ТОВАРЫ as t 
		inner join ЗАКАЗЫ as z
			on t.[ID товара] = z.[ID товара]
		group by t.[Название товара], t.[Количество на складе]
go

select * from [Заказанные товары]

drop view [Заказанные товары];
go

---------- 2 задание ----------

create view [Количество заказов]
	as select t.[Название товара][Товар], count(z.[Телефон заказчика])[Количество заказов] 
		from ТОВАРЫ as t
		inner join ЗАКАЗЫ as z
			on t.[ID товара] = z.[ID товара]
		group by t.[Название товара]
go
select * from [Количество заказов]

drop view [Количество заказов];
go

---------- 3 задание ----------

create view [Товарыы]([Название товара], [Количество на складе], [Цена])
	as select t.[ID товара][Код], t.[Название товара][Товар], t.[Количество на складе][Количество], t.Цена[Цена]
		from ТОВАРЫ as t
			where t.[Название товара] like '%iph%'

select * from [Товарыы]

insert [Товарыы] values('iphone 66', 10, 50)
update [Товарыы] set [Название товара] = 'iphone 55' where [Название товара] like 'iphone 66'
delete [Товарыы] where [Название товара] like 'iphone 55'

drop view [Товарыы]
go

---------- 4 задание ----------

create view [Товарыы]
	as select t.[ID товара][Код], t.[Название товара][Товар], t.[Количество на складе][Количество], t.Цена[Цена]
		from ТОВАРЫ as t
			where t.[Название товара] like '%iph%'

select * from [Товарыы]

drop view [Товарыы]

---------- 5 задание ----------

create view [Заказыы]
	as select top 100 z.[ID товара][Код], z.[Телефон заказчика][Телефон]
		from ЗАКАЗЫ as z
			order by z.[ID товара]

select * from [Заказыы]

drop view [Заказыы]

---------- 6 задание ----------

alter view [Количество заказов] with schemabinding
	as select t.[Название товара][Товар], count(z.[Телефон заказчика])[Количество заказов] 
		from dbo.ТОВАРЫ t
		inner join dbo.ЗАКАЗЫ z
			on t.[ID товара] = z.[ID товара]
		group by t.[Название товара]

select * from [Количество заказов]

drop view [Количество заказов]